// Написать алгоритм сложения двух чисел;
int numberA = 22;
int numberB = 8;
int summ = numberA + numberB;
Console.WriteLine(summ);
